#创建shop数据库（如果该数据库不存在）
create database if not exists `shop`;

use `shop`;
#创建数据表：商品表
create table if not exists `ecs_goods` (
  `goods_id` int unsigned NOT NULL PRIMARY KEY AUTO_INCREMENT comment 'ID',
  `goods_name` varchar(50) NOT NULL comment '商品名',
  `market_price` decimal(10,2) NOT NULL comment '价格'
) default charset=utf8;

#插入数据:`ecs_goods`
insert into `ecs_goods` values
(1,'KD876',1665.60),
(3,'诺基亚原装5800耳机',81.60),
(4,'诺基亚N85原装充电器',69.60),
(5,'索爱原装M2卡读卡器',24.00),
(6,'胜创KINGMAX内存卡',50.40),
(7,'诺基亚N85原装立体声耳机HS-82',120.00),
(8,'飞利浦9@9v',478.79),
(9,'诺基亚E66',2757.60),
(10,'索爱C702c',1593.60),
(11,'索爱C702c',0.00),
(12,'摩托罗拉A810',1179.60),
(13,'诺基亚5320 XpressMusic',1573.20),
(14,'诺基亚5800XM',3150.00),
(15,'摩托罗拉A810',945.60),
(16,'恒基伟业G101',988.00),
(17,'夏新N7',2760.00),
(18,'夏新T5',3453.60),
(19,'三星SGH-F258',1029.60),
(20,'三星BC01',336.00),
(21,'金立 A30',2400.00),
(22,'多普达Touch HD',7198.80),
(23,'诺基亚N96',4440.00),
(24,'P806',2400.00),
(25,'小灵通/固话50元充值卡',57.59),
(26,'小灵通/固话20元充值卡',22.80),
(27,'联通100元充值卡',100.00),
(28,'联通50元充值卡',50.00),
(29,'移动100元充值卡',0.00),
(30,'移动20元充值卡',21.00),
(31,'摩托罗拉E8',1604.39);
